Revit 2027 API
ModelCurveArrArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ModelCurveArrArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As ModelCurveArrArrayIterator
public:
virtual ModelCurveArrArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ModelCurveArrArrayIterator
override ForwardIterator : unit -> ModelCurveArrArrayIterator
Return Value
ModelCurveArrArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
ModelCurveArrArray Class
Autodesk.Revit.DB Namespace